#+TITLE: Vérification calcul pressure drag
#+author: Maxime Cochennec

#+EXPORT_EXCLUDE_TAGS: noexport

# # Default org-mode HTML style
# #+HTML_HEAD: <link rel="stylesheet" title="Standard" href="http://orgmode.org/worg/style/worg.css" type="text/css" />
# # Shiny readthedocs HTML style
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
#+HTML_HEAD: <script src="https://ajax.googleapis.com/ajax/libs/jquery/2.1.3/jquery.min.js"></script>
#+HTML_HEAD: <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.4/js/bootstrap.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/lib/js/jquery.stickytableheaders.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/readtheorg/js/readtheorg.js"></script>

* Problème

On cherche à calculer l'intégrale 
\begin{equation}
\frac{1}{S}\int_{\Gamma_{wo}}\gamma\left(\frac{\pi}{4}\kappa_{\parallel}-\frac{2}{h}\cos\theta\right)\mathbf{n}_{ow}\:\mathrm{d}l,
\end{equation}
afin de discuter la différence entre les forcets de trainées $\mathbf{d}_{ow}-\mathbf{d}_{wo}$.
#+begin_src python :results output :exports none :var data = ca05h5
import matplotlib
import numpy as np
matplotlib.use('Agg')
import matplotlib.pyplot as plt
from matplotlib import rc
from scipy.optimize import curve_fit
from scipy.integrate import trapz
from scipy import stats

xReconstruct = np.linspace(3e-3,4e-3, num=10000)

yArtificial = -5e-5*np.sin(xReconstruct*np.pi/1e-3)+3.5e-4 #artificial symmetric interface

xy = np.array(data,float)
z = np.polyfit(xy[:,0],xy[:,1],9)
yReconstruct = np.polyval(z,xReconstruct)
#----COMPUTE GRADIENT
dx  = np.gradient(xReconstruct)
ddx = np.gradient(dx)
dy  = np.gradient(yReconstruct)
ddy = np.gradient(dy)

#----COMPUTE NORMAL VECTOR
nx = np.divide(-dy,np.sqrt(dy**2))
ny = np.divide(dx,np.sqrt(dx**2))

#----COMPUTE ELEMENT LENGTH
ds = np.sqrt(dx**2+dy**2)

#----COMPUTE CURVATURE 
num = np.multiply(dx,ddy)-np.multiply(ddx,dy)
denom = (np.multiply(dx,dx)+np.multiply(dy,dy))**(3/2)

kappa = np.divide(num,denom)

L = np.sum(ds)

meankappa = trapz(kappa[2:-2],xReconstruct[2:-2])/L
meankappa1 = np.sum(np.multiply(kappa,ds))/L

integral = trapz(4e-5*np.multiply(nx,(kappa*np.pi/4-2/(5e-4))),xReconstruct)/(5e-4*1e-3)
integral1 = np.sum(np.multiply(4e-5*np.multiply(nx,ds),(kappa*np.pi/4-2/5e-4)))/(5e-4*1e-3)
plt.clf()
plt.plot(xReconstruct[2:-2],yArtificial[2:-2])
plt.plot(xReconstruct,yReconstruct)
plt.quiver(xReconstruct,yArtificial, nx, ny)
plt.plot(xy[:,0],xy[:,1])
plt.savefig('kappa.pdf')
print(meankappa,meankappa1,integral,integral1)
#+end_src

#+RESULTS:
: 25.478622573871732 26.17787044461565 19.909984677299175 19.40782231091749


[[file:kappa.pdf]]
